---
title: ReinforcementRoundingManager
classe: Autodesk.Revit.DB.Structure.ReinforcementRoundingManager
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ReinforcementRoundingManager

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Element Element { get; }` | `reinforcementRoundingManager.Element` | Element |
| `Boolean IsActiveOnElement { get; set; }` | `reinforcementRoundingManager.IsActiveOnElement` | Boolean |
| `Boolean IsValidObject { get; }` | `reinforcementRoundingManager.IsValidObject` | Boolean |
| `Void Dispose()` | `reinforcementRoundingManager.Dispose()` | Void |
| `ForgeTypeId GetLengthUnitTypeId()` | `reinforcementRoundingManager.GetLengthUnitTypeId()` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```